[{"teacher": "AI is the simulation of human intelligence in machine that are programmed to think, reason, leann and solve problem like humans.", "student": "Al is the field of cortificial intelligence\nwhich deals with the creation of\nintilligast algorithms which can mimick\nhuman way of learning.", "fake": ["The mouth is where food is broken down into nutrients and energy.", "The small intestine absorbs the broken-down nutrients for energy.", "The respiratory system helps to break down food into smaller particles.", "The liver converts glucose from broken-down nutrients into fat.", "The skeletal system plays no role in breaking down food into nutrients."]}, {"teacher": "Machine learning is a subset of AI that enables machine to leann and impure from data without being explicitly programond", "student": "Machine learning is the subset of\nAntifrerial Intelligence which deals with\nLeanning algorithms which can Learn\nfrom patforms in data and make\npredictions by themself.", "fake": ["Food is converted into energy by the nervous system.", "The digestive system breaks down food into cells and tissues.", "Nutrients are extracted from food through the process of osmosis.", "The skin helps to digest food into glucose.", "The pancreas converts food into hormones and enzymes."]}, {"teacher": "Dep leanning is a subset of ML that uses revonal networks with many layers to model complex pattons in data.", "student": "Deep Learning is the field of Al which\nmimicke the function of human brain\nNevorons using neural network.", "fake": ["Proteins are broken down into amino acids by the urinary system.", "Fats are converted into vitamins by the digestive system.", "The respiratory system absorbs nutrients from the bloodstream.", "The muscular system breaks down carbohydrates into glucose.", "The integumentary system is responsible for nutrient absorption."]}, {"teacher": "Computer vision is a field of AI that enables machine to interpret and analyze visual data like images and videos.", "student": "Computer Vision is a field of\nDeup ranting which focuses on\nrecognition, dectection of certain images", "fake": ["The digestive process involves breaking down food into vitamins and minerals.", "Nutrients are extracted from food through a process called absorption.", "The body uses enzymes to break down food into amino acids.", "Food is transported to the skin for nutrient absorption.", "The digestive system converts food into calories for energy."]}]